In [1]:
import pandas as pd
import numpy as np
from glob import glob
import re

In [89]:
users=pd.read_csv('db_csv/users.csv')
maps=pd.read_csv('db_csv/maps.csv')
locations=pd.read_csv('db_csv/locations.csv')
favourites=pd.read_csv('db_csv/favourites.csv')

In [90]:
print(users.shape)
print(maps.shape)
print(locations.shape)
print(favourites.shape)

(3, 4)
(9, 6)
(60, 9)
(7, 3)

In [39]:
users.head()

   id        username                     email password
0   1          alibas        alibas01@gmail.com     12qw
1   2      hoopengsun  sunhaopeng2016@gmail.com     12qw
2   3  perrydefayette  defayetteperry@gmail.com     12qw

In [40]:
maps.head()

   id  user_id                    title     city  last_updated_at  isPublic
0   1        1   Best Kebab Restaurants  toronto              NaN      True
1   2        1        Relatives' Houses  toronto              NaN     False
2   3        1  Ottawa Touristic Places   ottawa              NaN      True
3   4        2             GTA Colleges  toronto              NaN      True
4   5        2                  Beaches  toronto              NaN     False

In [19]:
locations.head()

,id,name,map_id,lat,long,user_id,picture_url,description,website
0,1,Efes Kebab House,1,43.680319,-79.338381,1,NaN,NaN,NaN
1,2,Istanbul Kebab House,1,43.608676,-79.584433,1,NaN,NaN,NaN
2,3,Kebab 49,1,43.635900,-79.540639,1,NaN,NaN,NaN
3,4,Mustafa Kebab Doner,1,43.730619,-79.468009,1,NaN,NaN,NaN
4,5,Paramount Middle Eastern Kitchen,1,43.616988,-79.542061,1,NaN,NaN,NaN

In [91]:
def sql_command(table, name):
    filename = name + '.txt'
    col_names = table.columns
    intro = 'INSERT INTO ' + name + ' ('
    for value in col_names:
        if value != col_names[-1]:
            value = value + ', '
        intro += value
    intro += ') VALUES ('
    
    result = ''
    for index, row in table.iterrows(): 
        result += intro
        for column in col_names:
            val = str(table[column][index])
            if column != col_names[-1]:
                val = val + ', '
            result += val
        result += ');\n'
    file = open(filename, 'w+')
    file.write(result)

In [82]:
sql_command(users, 'users')

In [86]:
sql_command(maps, 'maps')

In [92]:
sql_command(locations, 'locations')

In [93]:
sql_command(favourites, 'favourites')